<a href="https://colab.research.google.com/github/javilledo/machine-learning/blob/master/notebooks/t02_03_data_cleaning_agrupacion_de_datos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# AGREGACIÓN DE DATOS POR CATEGORÍA

In [1]:
import numpy as np
import pandas as pd

In [2]:
gender = ['Male', 'Female']
economic_status = ['Poor', 'Middle Class', 'Rich']

In [3]:
n = 500

gender_data = []
economic_status_data = []

for i in range(0,n):
  gender_data.append(np.random.choice(gender))
  economic_status_data.append(np.random.choice(economic_status))

In [4]:
gender_data[1:10]

['Male',
 'Female',
 'Female',
 'Male',
 'Male',
 'Male',
 'Female',
 'Female',
 'Male']

In [5]:
economic_status_data[1:10]

['Rich',
 'Middle Class',
 'Poor',
 'Poor',
 'Poor',
 'Rich',
 'Poor',
 'Poor',
 'Poor']

In [6]:
# N(m,s) = m + s * N(0,1)
height_data = 160 + 30 * np.random.randn(n)
weight_data = 65 + 25 * np.random.randn(n)
age_data = 30 + 12 * np.random.randn(n)
income_data = 18000 + 3500 * np.random.randn(n)

In [7]:
data = pd.DataFrame(
    {
        'Gender': gender_data,
        'Economic Status': economic_status_data,
        'Height': height_data,
        'Weight': weight_data,
        'Age': age_data,
        'Income': income_data      
    }
)
data.head()

   Gender Economic Status      Height      Weight        Age        Income
0    Male    Middle Class  175.006344   67.379187  33.629881  22308.749355
1    Male            Rich  170.652935  106.328351  28.320310  16606.235651
2  Female    Middle Class  134.347439   68.949271  11.464037  26113.687063
3  Female            Poor  154.356081   70.782271  18.828495  19947.094631
4    Male            Poor  124.364467   14.672607  31.837081  15469.219067

In [8]:
data['Age'] = [int(x) for x in data['Age']] #transformamos edad a entero
data.head()

   Gender Economic Status      Height      Weight  Age        Income
0    Male    Middle Class  175.006344   67.379187   33  22308.749355
1    Male            Rich  170.652935  106.328351   28  16606.235651
2  Female    Middle Class  134.347439   68.949271   11  26113.687063
3  Female            Poor  154.356081   70.782271   18  19947.094631
4    Male            Poor  124.364467   14.672607   31  15469.219067

# AGRUPACIÓN DE DATOS

In [9]:
grouped_gender = data.groupby('Gender')

In [10]:
grouped_gender.groups

{'Female': Int64Index([  2,   3,   7,   8,  10,  11,  16,  17,  20,  21,
             ...
             483, 484, 486, 487, 491, 493, 494, 495, 496, 499],
            dtype='int64', length=260),
 'Male': Int64Index([  0,   1,   4,   5,   6,   9,  12,  13,  14,  15,
             ...
             475, 476, 482, 485, 488, 489, 490, 492, 497, 498],
            dtype='int64', length=240)}

In [11]:
grouped_gender.groups['Female']

Int64Index([  2,   3,   7,   8,  10,  11,  16,  17,  20,  21,
            ...
            483, 484, 486, 487, 491, 493, 494, 495, 496, 499],
           dtype='int64', length=260)

In [12]:
grouped_gender.groups['Female'].values

array([  2,   3,   7,   8,  10,  11,  16,  17,  20,  21,  22,  24,  26,
        27,  29,  30,  32,  33,  35,  37,  38,  41,  42,  43,  44,  45,
        46,  51,  52,  55,  57,  59,  60,  61,  62,  63,  64,  65,  67,
        69,  70,  73,  77,  78,  79,  80,  84,  85,  90,  91,  92,  93,
        94,  97, 100, 101, 102, 103, 105, 107, 109, 110, 111, 112, 116,
       117, 118, 123, 127, 128, 129, 130, 131, 133, 135, 138, 139, 140,
       142, 143, 144, 147, 150, 151, 152, 154, 155, 156, 158, 164, 167,
       171, 173, 179, 181, 182, 183, 188, 189, 190, 191, 192, 194, 196,
       199, 201, 202, 209, 210, 211, 213, 214, 216, 217, 218, 219, 221,
       222, 224, 225, 226, 229, 230, 240, 242, 243, 246, 251, 252, 254,
       255, 256, 257, 258, 259, 260, 262, 263, 268, 270, 271, 275, 276,
       278, 280, 283, 285, 286, 287, 290, 291, 294, 295, 297, 298, 302,
       304, 305, 307, 308, 310, 315, 321, 322, 323, 324, 325, 327, 330,
       331, 332, 333, 335, 339, 341, 345, 348, 349, 351, 354, 356, 357,
       358, 359, 360, 362, 363, 365, 371, 372, 374, 375, 378, 383, 384,
       389, 392, 393, 395, 396, 398, 401, 404, 406, 408, 409, 413, 416,
       417, 418, 419, 420, 421, 422, 424, 426, 429, 430, 435, 436, 437,
       438, 439, 440, 441, 442, 443, 445, 447, 448, 449, 452, 453, 457,
       458, 459, 461, 463, 465, 468, 469, 470, 472, 473, 474, 477, 478,
       479, 480, 481, 483, 484, 486, 487, 491, 493, 494, 495, 496, 499])

In [13]:
for names, groups in grouped_gender:
  print(names)
  print(groups)

Female
     Gender Economic Status      Height     Weight  Age        Income
2    Female    Middle Class  134.347439  68.949271   11  26113.687063
3    Female            Poor  154.356081  70.782271   18  19947.094631
7    Female            Poor  117.141118  17.719737   35  17755.747383
8    Female            Poor  142.115343  59.554666   26  18107.612670
10   Female            Rich  225.083736  40.347690   28  13620.977952
..      ...             ...         ...        ...  ...           ...
493  Female            Poor  166.318753  72.372459   30  21006.975893
494  Female            Rich   96.335310  54.164186   39   9859.219912
495  Female            Poor  172.702789  45.798646    8  15751.004559
496  Female            Rich  124.281336  52.131240   47  25024.842223
499  Female            Poor  135.054316  42.350813   21  18404.629378

[260 rows x 6 columns]
Male
    Gender Economic Status      Height      Weight  Age        Income
0     Male    Middle Class  175.006344   67.379187   33  22308.749355
1     Male            Rich  170.652935  106.328351   28  16606.235651
4     Male            Poor  124.364467   14.672607   31  15469.219067
5     Male            Poor  133.243049   65.343582   49  17000.128706
6     Male            Rich  187.816326   78.649300    8  16141.416081
..     ...             ...         ...         ...  ...           ...
489   Male    Middle Class  130.687045   77.359815   32  15765.571280
490   Male            Poor   85.986153   64.913873   17  19537.755031
492   Male            Poor  150.209927   76.463181   32  15857.354036
497   Male            Rich  181.673802   40.150976   37  18741.372648
498   Male    Middle Class  156.080765   14.663293    9  24790.976299

[240 rows x 6 columns]

In [14]:
grouped_gender.get_group('Female')

     Gender Economic Status      Height     Weight  Age        Income
2    Female    Middle Class  134.347439  68.949271   11  26113.687063
3    Female            Poor  154.356081  70.782271   18  19947.094631
7    Female            Poor  117.141118  17.719737   35  17755.747383
8    Female            Poor  142.115343  59.554666   26  18107.612670
10   Female            Rich  225.083736  40.347690   28  13620.977952
..      ...             ...         ...        ...  ...           ...
493  Female            Poor  166.318753  72.372459   30  21006.975893
494  Female            Rich   96.335310  54.164186   39   9859.219912
495  Female            Poor  172.702789  45.798646    8  15751.004559
496  Female            Rich  124.281336  52.131240   47  25024.842223
499  Female            Poor  135.054316  42.350813   21  18404.629378

[260 rows x 6 columns]

In [15]:
data.groupby('Economic Status').get_group('Poor')

     Gender Economic Status      Height     Weight  Age        Income
3    Female            Poor  154.356081  70.782271   18  19947.094631
4      Male            Poor  124.364467  14.672607   31  15469.219067
5      Male            Poor  133.243049  65.343582   49  17000.128706
7    Female            Poor  117.141118  17.719737   35  17755.747383
8    Female            Poor  142.115343  59.554666   26  18107.612670
..      ...             ...         ...        ...  ...           ...
491  Female            Poor  158.255507  73.897300   36  20441.936282
492    Male            Poor  150.209927  76.463181   32  15857.354036
493  Female            Poor  166.318753  72.372459   30  21006.975893
495  Female            Poor  172.702789  45.798646    8  15751.004559
499  Female            Poor  135.054316  42.350813   21  18404.629378

[157 rows x 6 columns]

In [16]:
double_group = data.groupby(['Gender', 'Economic Status'])

In [17]:
len(double_group)

6

In [18]:
for names, groups in double_group:
  print(names)
  print(groups)

('Female', 'Middle Class')
     Gender Economic Status      Height      Weight  Age        Income
2    Female    Middle Class  134.347439   68.949271   11  26113.687063
11   Female    Middle Class  161.198700   59.051519   43  18747.408982
21   Female    Middle Class  113.005597   44.962755   14  23288.983267
22   Female    Middle Class  174.530405   87.765059   48  23945.839967
30   Female    Middle Class  144.802640  127.523057   24  21651.376704
..      ...             ...         ...         ...  ...           ...
474  Female    Middle Class  196.204012   67.581218   22  14951.233491
477  Female    Middle Class  169.312570   47.347564   39  18619.705911
481  Female    Middle Class  170.714508   57.221955   24  22105.852908
483  Female    Middle Class  195.859297   40.610479   40  20648.388039
486  Female    Middle Class  174.958642   84.409089   40  21451.509886

[85 rows x 6 columns]
('Female', 'Poor')
     Gender Economic Status      Height     Weight  Age        Income
3    Female            Poor  154.356081  70.782271   18  19947.094631
7    Female            Poor  117.141118  17.719737   35  17755.747383
8    Female            Poor  142.115343  59.554666   26  18107.612670
26   Female            Poor  183.793693  31.793172   22  15550.382035
37   Female            Poor  184.425306  37.198876    9  25067.707314
..      ...             ...         ...        ...  ...           ...
487  Female            Poor  146.533631  84.991689   37  22212.490066
491  Female            Poor  158.255507  73.897300   36  20441.936282
493  Female            Poor  166.318753  72.372459   30  21006.975893
495  Female            Poor  172.702789  45.798646    8  15751.004559
499  Female            Poor  135.054316  42.350813   21  18404.629378

[83 rows x 6 columns]
('Female', 'Rich')
     Gender Economic Status      Height     Weight  Age        Income
10   Female            Rich  225.083736  40.347690   28  13620.977952
16   Female            Rich  159.331028  31.577651   26  17980.440985
17   Female            Rich  162.774976  68.803959   33  19914.605631
20   Female            Rich  154.925204  37.142820   20  21561.089697
24   Female            Rich  149.570117  44.996990   23  20535.451539
..      ...             ...         ...        ...  ...           ...
473  Female            Rich   90.022861  36.469857   39  21349.641309
478  Female            Rich  134.350908  71.496549   34  15375.538009
480  Female            Rich  139.014279  84.518992   25  12461.877278
494  Female            Rich   96.335310  54.164186   39   9859.219912
496  Female            Rich  124.281336  52.131240   47  25024.842223

[92 rows x 6 columns]
('Male', 'Middle Class')
    Gender Economic Status      Height     Weight  Age        Income
0     Male    Middle Class  175.006344  67.379187   33  22308.749355
14    Male    Middle Class  172.781878  71.462676   19  18869.079880
18    Male    Middle Class  201.679536  86.815543   27  17924.442962
19    Male    Middle Class  110.434393  66.050525   28  21925.247829
31    Male    Middle Class  116.461670  75.985905   30  20733.519918
..     ...             ...         ...        ...  ...           ...
476   Male    Middle Class  116.507846  87.628735   33  20246.705214
485   Male    Middle Class  139.571730  81.750265   16  17758.174060
488   Male    Middle Class  137.525269  59.297022   33  19840.350445
489   Male    Middle Class  130.687045  77.359815   32  15765.571280
498   Male    Middle Class  156.080765  14.663293    9  24790.976299

[86 rows x 6 columns]
('Male', 'Poor')
    Gender Economic Status      Height      Weight  Age        Income
4     Male            Poor  124.364467   14.672607   31  15469.219067
5     Male            Poor  133.243049   65.343582   49  17000.128706
9     Male            Poor  258.321102   56.252518   34  11968.533743
12    Male            Poor  220.225195   79.295392   26  12905.047551
15    Male            Poor  179.479848  104.366568    6  15823.816365
..     ...             ...         ...         ...  ...           ...
444   Male            Poor  184.270427   65.429249   12  15778.224947
467   Male            Poor  175.322257   57.764629   32  14558.798075
482   Male            Poor  145.530975   39.234270   33  16070.633864
490   Male            Poor   85.986153   64.913873   17  19537.755031
492   Male            Poor  150.209927   76.463181   32  15857.354036

[74 rows x 6 columns]
('Male', 'Rich')
    Gender Economic Status      Height      Weight  Age        Income
1     Male            Rich  170.652935  106.328351   28  16606.235651
6     Male            Rich  187.816326   78.649300    8  16141.416081
13    Male            Rich  171.364769   84.050951   58  18161.696378
23    Male            Rich  164.474998   30.730426   28  18942.189614
34    Male            Rich  140.538155   47.941683   22  21898.205789
..     ...             ...         ...         ...  ...           ...
462   Male            Rich  200.877392   61.141613   12  17360.421008
464   Male            Rich  202.258320   95.841971   40  21136.167536
466   Male            Rich  201.550001   80.161087   56  15907.991798
475   Male            Rich  158.099339   84.660205   36  15520.276991
497   Male            Rich  181.673802   40.150976   37  18741.372648

[80 rows x 6 columns]

In [19]:
double_group.get_group(('Male', 'Rich'))

    Gender Economic Status      Height      Weight  Age        Income
1     Male            Rich  170.652935  106.328351   28  16606.235651
6     Male            Rich  187.816326   78.649300    8  16141.416081
13    Male            Rich  171.364769   84.050951   58  18161.696378
23    Male            Rich  164.474998   30.730426   28  18942.189614
34    Male            Rich  140.538155   47.941683   22  21898.205789
..     ...             ...         ...         ...  ...           ...
462   Male            Rich  200.877392   61.141613   12  17360.421008
464   Male            Rich  202.258320   95.841971   40  21136.167536
466   Male            Rich  201.550001   80.161087   56  15907.991798
475   Male            Rich  158.099339   84.660205   36  15520.276991
497   Male            Rich  181.673802   40.150976   37  18741.372648

[80 rows x 6 columns]

## OPERACIONES SOBRE DATOS AGRUPADOS

In [20]:
double_group.sum()

                              Height       Weight   Age        Income
Gender Economic Status
Female Middle Class     13253.854089  5559.910303  2595  1.603508e+06
       Poor             13381.710913  5144.875362  2412  1.503377e+06
       Rich             14943.216326  5709.751810  2614  1.681072e+06
Male   Middle Class     13797.521028  5640.066339  2556  1.581225e+06
       Poor             11833.749960  4990.738694  2189  1.306640e+06
       Rich             12673.173300  5453.565891  2505  1.441045e+06

In [21]:
double_group.mean()

                            Height     Weight        Age        Income
Gender Economic Status
Female Middle Class     155.927695  65.410709  30.529412  18864.794712
       Poor             161.225433  61.986450  29.060241  18112.978570
       Rich             162.426264  62.062520  28.413043  18272.519174
Male   Middle Class     160.436291  65.582167  29.720930  18386.334163
       Poor             159.915540  67.442415  29.581081  17657.299210
       Rich             158.414666  68.169574  31.312500  18013.060286

In [22]:
double_group.size()

Gender  Economic Status
Female  Middle Class       85
        Poor               83
        Rich               92
Male    Middle Class       86
        Poor               74
        Rich               80
dtype: int64

In [23]:
double_group.describe()

                       Height              ...        Income
                        count        mean  ...           75%           max
Gender Economic Status                     ...
Female Middle Class      85.0  155.927695  ...  21187.058530  27066.212839
       Poor              83.0  161.225433  ...  20064.995074  26129.851971
       Rich              92.0  162.426264  ...  20544.413230  26567.930247
Male   Middle Class      86.0  160.436291  ...  20058.612858  29805.345359
       Poor              74.0  159.915540  ...  19442.444598  27823.101881
       Rich              80.0  158.414666  ...  20273.162550  26248.704928

[6 rows x 32 columns]

In [26]:
grouped_income = double_group['Income']
grouped_income.describe()

                        count          mean  ...           75%           max
Gender Economic Status                       ...
Female Middle Class      85.0  18864.794712  ...  21187.058530  27066.212839
       Poor              83.0  18112.978570  ...  20064.995074  26129.851971
       Rich              92.0  18272.519174  ...  20544.413230  26567.930247
Male   Middle Class      86.0  18386.334163  ...  20058.612858  29805.345359
       Poor              74.0  17657.299210  ...  19442.444598  27823.101881
       Rich              80.0  18013.060286  ...  20273.162550  26248.704928

[6 rows x 8 columns]

In [27]:
# con agregate se puede hacer un describe todo lo personalizado que queramos
double_group.aggregate(
    {
        'Income': np.sum,
        'Age': np.mean,
        'Height': np.std
    }
)

                              Income        Age     Height
Gender Economic Status
Female Middle Class     1.603508e+06  30.529412  32.918788
       Poor             1.503377e+06  29.060241  28.544196
       Rich             1.681072e+06  28.413043  28.493572
Male   Middle Class     1.581225e+06  29.720930  32.284705
       Poor             1.306640e+06  29.581081  37.223936
       Rich             1.441045e+06  31.312500  26.730864

In [28]:
# En lugar de aplicar unas funciones ya existentes, podemos aplicar alguna personalizada que hayamos definido
# podemos hacerlo con una función lambda si solo vamos a hacerlo una vez
# La tipificación consiste en dividir la media entre la desviación típica.
double_group.aggregate(
    {
        'Age': np.mean,
        'Height': lambda h: np.mean(h) / np.std(h)
    }
)

                              Age    Height
Gender Economic Status
Female Middle Class     30.529412  4.764850
       Poor             29.060241  5.682610
       Rich             28.413043  5.731689
Male   Middle Class     29.720930  4.998567
       Poor             29.581081  4.325365
       Rich             31.312500  5.963673

In [30]:
double_group.aggregate([np.sum, np.mean, np.std])

                              Height              ...        Income
                                 sum        mean  ...          mean          std
Gender Economic Status                            ...
Female Middle Class     13253.854089  155.927695  ...  18864.794712  3471.559778
       Poor             13381.710913  161.225433  ...  18112.978570  3429.276058
       Rich             14943.216326  162.426264  ...  18272.519174  3228.227169
Male   Middle Class     13797.521028  160.436291  ...  18386.334163  3199.038827
       Poor             11833.749960  159.915540  ...  17657.299210  3154.806746
       Rich             12673.173300  158.414666  ...  18013.060286  3106.007644

[6 rows x 12 columns]

In [31]:
double_group.aggregate([lambda x: np.mean(x) / np.std(x)])

                          Height    Weight       Age    Income
                        <lambda>  <lambda>  <lambda>  <lambda>
Gender Economic Status
Female Middle Class     4.764850  2.593522  2.596714  5.466348
       Poor             5.682610  2.728343  2.594517  5.313975
       Rich             5.731689  2.524375  2.342922  5.691249
Male   Middle Class     4.998567  2.562320  2.815490  5.781165
       Poor             4.325365  2.713895  2.535548  5.635156
       Rich             5.963673  2.754404  2.428750  5.836015

# FILTRADO DE DATOS